src/test/resources/bin/wrk
#!/bin/sh

echo 'Running 30s test @ http://127.0.0.1:8080/index.html'
echo '  12 threads and 400 connections'
echo '  Thread Stats   Avg      Stdev     Max   +/- Stdev'
echo '    Latency   635.91us    0.89ms  12.92ms   93.69%'
echo '    Req/Sec    56.20k     8.07k   62.00k    86.54%'
echo '  0 requests in 30.00s, 17.76GB read'
echo 'Requests/sec: 748868.53'
echo 'Transfer/sec:    606.33MB'