src/test/resources/bin/wrk2
#!/bin/sh

echo "Running 30s test @ http://127.0.0.1:80/index.html"
echo "  2 threads and 100 connections"
echo "  Thread calibration: mean lat.: 9747 usec, rate sampling interval: 21 msec"
echo "  Thread calibration: mean lat.: 9631 usec, rate sampling interval: 21 msec"
echo "  Thread Stats   Avg      Stdev     Max   +/- Stdev"
echo "    Latency     6.46ms    1.93ms  12.34ms   67.66%"
echo "    Req/Sec     1.05k     1.12k    2.50k    64.84%"
echo "  0 requests in 30.01s, 19.81MB read"
echo "Requests/sec:   2000.15"
echo "Transfer/sec:    676.14KB"